import streamlit as st

menu = st.sidebar.radio("***",
    (
    "Общее определение принадлежности графика к одномерным",
    "Линейные графики",
    "Точечные диаграммы",
    "Столбчатые диаграммы",
    "Гистограммы распределений",
    "Ступенчатые графики",
    )
)

if menu == "Общее определение принадлежности графика к одномерным":
    r"""
##### Общее определение принадлежности графика к одномерным
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Линейные графики":
    r"""
##### Линейные графики
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Точечные диаграммы":
    r"""
##### Точечные диаграммы
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Столбчатые диаграммы":
    r"""
##### Столбчатые диаграммы
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Гистограммы распределений":
    r"""
##### Гистограммы распределений
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Ступенчатые графики":
    r"""
##### Ступенчатые графики
* Что-то тут сказано
* И тут
* А ещё здесь
    """