import streamlit as st

menu = st.sidebar.radio("***",
    (
    "Что такое элементы оформления в программировании",
    "Настройка осей",
    "Легенда с параметрами расположения",
    "Сетка",
    "Текст и аннотации",
    "Математические формулы",
    "Стили оформления",
    )
)

if menu == "Что такое элементы оформления в программировании":
    r"""
##### Что такое элементы оформления в программировании
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Настройка осей":
    r"""
##### Настройка осей
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Легенда с параметрами расположения":
    r"""
##### Легенда с параметрами расположения
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Сетка":
    r"""
##### Сетка
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Текст и аннотации":
    r"""
##### Текст и аннотации
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Математические формулы":
    r"""
##### Математические формулы
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Стили оформления":
    r"""
##### Стили оформления
* Что-то тут сказано
* И тут
* А ещё здесь
    """