import streamlit as st

menu = st.sidebar.radio("***",
    (
    "Общее определение принадлежности графика к двумерным",
    "Псевдоцветные графики",
    "Контурные графики",
    "Векторные поля",
    "Диаграммы рассеяния 2D",
    "Гистограммы 2D",
    )
)

if menu == "Общее определение принадлежности графика к двумерным":
    r"""
##### Общее определение принадлежности графика к двумерным
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Псевдоцветные графики":
    r"""
##### Псевдоцветные графики
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Контурные графики":
    r"""
##### Контурные графики
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Векторные поля":
    r"""
##### Векторные поля
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Диаграммы рассеяния 2D":
    r"""
##### Диаграммы рассеяния 2D
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Гистограммы 2D":
    r"""
##### Гистограммы 2D
* Что-то тут сказано
* И тут
* А ещё здесь
    """