import streamlit as st

menu = st.sidebar.radio("***",
    (
    "Для чего нужна 3D графика в программировании",
    "Активация 3D",
    "Поверхности (3D surfaces)",
    "Сетки",
    "Точечные 3D графики",
    "Линейные 3D графики",
    "Оформление 3D сцен",
    )
)

if menu == "Для чего нужна 3D графика в программировании":
    r"""
##### Для чего нужна 3D графика в программировании
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Активация 3D":
    r"""
##### Активация 3D
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Поверхности (3D surfaces)":
    r"""
##### Поверхности (3D surfaces)
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Сетки":
    r"""
##### Сетки
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Точечные 3D графики":
    r"""
##### Точечные 3D графики
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Линейные 3D графики":
    r"""
##### Линейные 3D графики
* Что-то тут сказано
* И тут
* А ещё здесь
    """

if menu == "Оформление 3D сцен":
    r"""
##### Оформление 3D сцен
* Что-то тут сказано
* И тут
* А ещё здесь
    """